import Image from "next/image";
import Link from "next/link";

const data = [
    {
        title: "อนุบาล 1 - ประถมศึกษาปีที่ 5",
        description: "ฉันเริ่มต้นการเรียนที่โรงเรียนดาราวิทยาลัย ในเรื่องพื้นฐานเหมือนเด็กทั่วไปอย่าง การอ่าน การเขียน การคิดวิเคราะห์ แต่ก็ไม่โดดเด่นในเรื่องการเรียน อีกทั้งยังชอบออกไปเล่นนอกห้อง บางครั้งก็รู้สึกว่าการทำความเข้าใจเนื้อหาบางอย่างเป็นเรื่องยาก ทำให้ได้สัมผัสถึงสายตาและคำพูดจากครู เพื่อน และระบบโรงเรียน ที่บางครั้งก็ทำให้เด็กอย่างฉันรู้สึกไม่มั่นใจในตัวเอง ฉันเข้าใจว่าเด็กที่เรียนช้าหรือเข้าใจยาก มักจะถูกมองว่า \"ไม่ตั้งใจ\" หรือ \"ไม่มีศักยภาพ\" และถูกตำหนิแทนที่จะได้รับความช่วยเหลือ",
        image: "/images/ed1.webp"
    }, {
        title: "ประถมศึกษาปีที่ 6 - มัธยมศึกษาปีที่ 6",
        description: "เมื่อถึงช่วงประถมศึกษาปีที่ 6 ฉันได้เปลี่ยนเส้นทางการเรียนไปนอกระบบ Homeschool ซึ่งเป็นจุดเปลี่ยนสำคัญสำหรับฉัน และครอบครัวที่เป็นครูในระบบโรงเรียน ช่วงเวลานี้ฉันได้ลองทำอะไรมากมาย ไม่ว่าจะเป็นการทำโปรเจ๊กแข่งขัน ทำอาหาร เล่นดรตรี เปิดแบนของตัวเอง เล่นกีฬา เดินทางสายเข้าข่ายไปทั่วประเทศไทย ช่วงเวลานี้ ฉันเรียนร่วมในบางวิชาของโรงเรียน ABS - Ambassador Bilingual School ซึ่งช่วยให้ฉันได้รับประสบการณ์ด้านภาษาและวิชาการ และทักษะการทำงานร่วมกับผู้อื่นในบริบทที่แตกต่าง ได้ร่วมเรียนใน Animation and Visual Effects กับวิทยาลัยศิลปะ สื่อ และเทคโนโลยี มหาวิทยาลัยเชียงใหม่ (CAMT) ซึ่งเป็นจุดเริ่มต้นของความสนใจในการสร้างอนิเมชันแบบ 2D และ 3D",
        image: "/images/ed2.webp"
    }, {
        title: "ปริญญาตรี (สิงหาคม พ.ศ. 2565 - ปัจจุบัน)",
        description: "หลังจากจบการศึกษาในระดับมัธยม ฉันได้เข้าเรียนต่อในระดับปริญญาตรีในรอบ 1 พอสโฟรีโอ ที่ คณะวิทยาการเรียนรู้และศึกษาศาสตร์ มหาวิทยาลัยธรรมศาสตร์ โดยตลอดเวลาที่เรียนในมหาวิทยาลัย ฉันได้มีโอกาสศึกษาวิชาที่เกี่ยวข้องกับการเรียนรู้ในหลากหลายมิติ ไม่ว่าจะเป็นการเรียนรู้ของมนุษย์ ทำให้เข้าใจว่าการเรียนรู้มีความหลากหลายและแตกต่างกันในแต่ละบุคคล เกมและการเรียนรู้ เปิดมุมมองใหม่เกี่ยวกับการใช้เกมเป็นเครื่องมือเพื่อส่งเสริมการเรียนรู้ สื่อเพื่อการสอน สอนให้ฉันออกแบบและสร้างสรรค์สื่อการเรียนรู้ที่มีประสิทธิภาพ โครงการนวัตกรรมเพื่อการเปลี่ยนแปลง ช่วยพัฒนาทักษะการคิดสร้างสรรค์และการออกแบบโครงการเพื่อแก้ปัญหา และสารัตถะการอำนวยการเรียนรู้ ทำให้เข้าใจบทบาทของการเป็นผู้ช่วยให้ผู้อื่นสามารถเรียนรู้ได้ด้วยตัวเอง ด้วยผลการเรียนเฉลี่ย 3.47",
        image: "/images/ed3.webp"
    }
]

export default function Education() {
    return (<div className="flex flex-col gap-6 p-4 lg:p-8 w-full bg-[#242323] bg-opacity-90 max-w-7xl">
        <Link href="/" className="hover:text-amber-300 transition-colors duration-300 text-white">back to home</Link>
        <h1 className="text-5xl">Education</h1>
        {
            data.map((elem) => <div className="w-full flex flex-col lg:flex-row gap-5 bg-black p-8" key={elem.title}>
                <div className="w-full lg:w-2/3">
                    <b className="text-3xl">{elem.title}</b>
                    <div className="w-full h-0 border border-yellow-500 mt-4 mb-8"></div>
                    <p className="text-xl">{elem.description}</p>
                </div>
                <div className="w-full lg:w-1/3">
                    <Image src={elem.image} alt="eduction image" width={5000} height={5000} className="border-2 border-yellow-500"></Image>      
                </div>
            </div>
            )
        }
    </div>)
}